package main

import "ch05"

func main() {
	// 第一章节
	// 练习1
	//ch01.Q1()
	//// 练习2
	//ch01.Q2()
	//// 练习3
	//ch01.Q3()
	//// 练习4
	//ch01.Q4()
	//// 第二章节
	//// 练习5
	//ch02.Q5()
	//// 练习6
	//ch02.Q6()
	////练习7
	//ch02.Q7()
	////练习8
	//ch02.Q8()
	////练习9
	//ch02.Q9()
	////练习10
	//ch02.Q10()
	////练习11
	//ch02.Q11()
	//// 练习12
	//ch02.Q12()
	//// 练习13
	//ch02.Q13()
	//// 练习14
	//ch02.Q14()
	//// 练习16
	////ch03.Q16()
	//// 练习17
	//ch04.Q17()
	//// 练习18
	//ch04.Q18()
	//// 练习19
	//ch04.Q19()
	//// 练习20
	//ch04.Q20()
	// 练习25
	ch05.Q25()

}
